{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "input_dtype": "float32", "init": "glorot_uniform", "nb_row": 5, "subsample": [2, 2], "name": "convolution2d_6", "W_constraint": null, "b_constraint": null, "nb_filter": 48, "dim_ordering": "tf", "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "activation": "relu", "W_regularizer": null, "bias": true, "nb_col": 5, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "subsample": [2, 2], "name": "convolution2d_7", "W_constraint": null, "b_constraint": null, "nb_filter": 48, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "activation": "relu", "W_regularizer": null, "bias": true, "nb_col": 5, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "subsample": [2, 2], "name": "convolution2d_8", "W_constraint": null, "b_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "activation": "relu", "W_regularizer": null, "bias": true, "nb_col": 5, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_9", "W_constraint": null, "b_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "activation": "relu", "W_regularizer": null, "bias": true, "nb_col": 3, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_10", "W_constraint": null, "b_constraint": null, "nb_filter": 96, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "activation": "relu", "W_regularizer": null, "bias": true, "nb_col": 3, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 1164, "name": "dense_6", "input_dim": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 200, "name": "dense_7", "input_dim": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 100, "name": "dense_8", "input_dim": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 20, "name": "dense_9", "input_dim": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 1, "name": "dense_10", "input_dim": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "bias": true}}]}